{"display": "Vehicle Systems >> Diagnostic Aids (Diagrams) >> Troubleshooting Tools", "title": "Troubleshooting Tools", "content": "<b>TROUBLESHOOTING TOOLS</b><br/>\n<br/>\n&nbsp;When diagnosing a problem in an electrical circuit, there are several common tools necessary. These tools are listed and explained below.<br/>\n<br/>\n&nbsp;<b>-&nbsp;&nbsp;Jumper Wire</b> - This is a test wire used to connect two points of a circuit. It can be used to bypass an open in a circuit.<br/>\n<br/>\n&nbsp;&nbsp;&nbsp;&nbsp;<b>WARNING:  NEVER USE A JUMPER WIRE ACROSS A LOAD, SUCH AS A MOTOR, CONNECTED BETWEEN A BATTERY FEED AND GROUND.</b><br/>\n<br/>\n&nbsp;<b>-&nbsp;&nbsp;Voltmeter</b> - This instrument is used to check for voltage on a circuit. Always connect the black lead to a known good ground and the red lead to the positive side of the circuit.<br/>\n<br/>\n&nbsp;&nbsp;&nbsp;&nbsp;<b>CAUTION:</b>  Most of the electrical components used in today's vehicle are solid state. When checking voltages in these circuits, use a meter with a <b>10 megohm</b> or greater impedance.<br/>\n<br/>\n&nbsp;<b>-&nbsp;&nbsp;Ohmmeter</b> - This instrument is used to check the resistance between two points of a circuit. Low or no resistance in a circuit can mean good continuity or a shorted circuit.<br/>\n<br/>\n&nbsp;&nbsp;&nbsp;&nbsp;<b>CAUTION:</b>  Most of the electrical components used in today's vehicle are solid state. When checking resistance in these circuits, use a meter with a <b>10 megohm</b> or greater impedance. In addition, be sure the power is disconnected from the circuit. Circuits that are powered-up by the vehicle electrical system can cause damage to the equipment and provide false readings.<br/>\n<br/>\nProbing Tool<br/><img class=\"thumbnail\" style=\"width:416px; height:239px;\" src=\"/ADAG/repair/ADConnect/v5/carids/21136/thumbnails/cr99miniv_8w01-009a_png/metadata/cr99miniv_8w01-009a_svg/?locale=en_US&amp;region=Region_1\" alt=\"image\" img_dpi=\"0\" img_name=\"cr99miniv_8w01-009a\" img_width=\"832\" img_height=\"479\" img_rotation=\"0\" /><br/>\n<a class=\"image\" href=\"/ADAG/repair/ADConnect/v5/carids/21136/components/1/itypes/91/show_itypes/7/image_article/0/?locale=en_US&amp;region=Region_1\">Click for full-size image</a><br/><br/>\n&nbsp;<b>-&nbsp;&nbsp;Probing Tools</b> - These tools are used for probing terminals in connectors. Select the proper size tool from Special Tool Package <b>6807</b> and insert it into the terminal being tested. Use the other end of the tool to insert the meter probe.<br/>\n", "image": "21136/diagrams/VehicleSystems__DiagnosticAidsDiagrams__TroubleshootingTools.png", "fname": "21136/diagrams/VehicleSystems__DiagnosticAidsDiagrams__TroubleshootingTools.json"}